import {QueryRow} from "../../model";

export const prompt: QueryRow[] = [
  {
    role: "system",
    content:
      "'별이 빛나는 밤'은 아래와 같은 정보를 갖습니다.\n" +
      "```\n" +
      "화가: 빈센트 반고흐\n" +
      "국가: 네덜란드\n" +
      "제작: 1989년\n" +
      "사조: 후기 인상주의\n" +
      "종류: 유체화\n" +
      "기법: 캔버스에 유체\n" +
      "크기: 73.7cm x 92.1cm\n" +
      "소장: 미국 뉴욕 현대미술관\n" +
      "```"
  },
  {
    role: "system",
    content:
      "'별이 빛나는 밤'은 아래와 같은 배경을 갖고 있습니다.\n" +
      "```\n" +
      "화가로서 붓을 막 들기 시작한 고흐는 또 다른 화가 폴 고갱과 동거한다. " +
      "거주지는 따뜻한 햇살로 유명한 프랑스 아들이었다. " +
      "허나 산뜻한 출발과 다르게 둘 사이에는 좁힐래야 좁힐 수 없는 커다란 예술관의 차이가 있었다. " +
      "갈등은 날이 갈수록 커졌다. " +
      "고갱은 고흐에게 \"돈도 못 버는 화가\"라며 비판했고, 고흐는 고갱을 \"돈만 아는 화가\"라며 응수했다. " +
      "결정적인 사건은 아를의 한 카페에서 발생한다. " +
      "카페 주인 마담 지누를 고흐와 고갱이 전혀 다르게 묘사한 것이다. " +
      "서로의 차이를 받아들이지 못한 이들은 또다시 갈등하고, 고흐가 분을 참지 못하고 자신의 귀를 잘라버리며 끝난다. " +
      "그 후 마을에서 정신병자 취급을 받자 생 레미 요양원에서 요양하며 느꼈던 정신적 고통을 소용돌이로 묘사했다고 한다.\n" +
      "```\n"
  },
  {
      role: "system",
      content:
        "'별이 빛나는 밤'은 아래와 같은 화풍을 갖고 있습니다.\n" +
        "```\n" +
        "밤하늘에 별이 떠 있는 모습으로, 이 작품에 쓰인 특유의 화법은 이후 지금도 다른 화가들에 의하여 많이 사용된다. " +
        "반 고흐의 아를 체류시기 밤의 풍경은 <론 강 위로 별이 빛나는 밤>에서도 알 수 있듯이 별에 대한 탐구가 두드러진다. " +
        "그가 밤의 풍경을 묘사했을 때 자주 사용했던 코발트 블루가 이 작품에서도 주된 색조를 차지한다.\n" +
        "별과 그 주변부의 묘사에 있어서도 반 고흐는 아를 체류 시기 그렸던 <론 강의 별이 빛나는 밤>에서와 마찬가지로 화폭에 직접 흰색 튜브 물감을 짜서 하이라이트 효과를 주었다. " +
        "또한 그는 칠하는 과정에 있어서도 단순히 붓을 칠하는 것을 넘어서 붓의 자루 혹은 갈대로 표면을 긁어냄으로서 독특한 화풍을 연출했다. " +
        "반 고흐가 이렇듯 일반적인 채색 방법을 사용하지 않은 것은 색채에 대한 그의 생각이 반영된 것에 다름 아니었다. " +
        "파리 체류 시절 인상주의 화풍을 접한 고흐는 인상주의 그림들을 통해서 색면이 화가의 감정을 표현할 수 있는 주된 수단이 될 수 있다는 것을 발견했다. " +
        "이는 후기 인상주의로 분류되는 화가들 가령 세잔이 색채에 대해서 보였던 태도와는 차이가 있는 것이다.\n" +
        "구도적인 측면에 있어서 <별이 빛나는 밤>은 전경의 마을 풍경을 최대한으로 축소하고 하늘의 풍경과 수직으로 뻗어나가는 삼나무를 주된 묘사 대상으로 삼았는데 이는 고흐가 풍경화를 그릴 때 자주 이용했던 방법이다. " +
        "1888년 9월 아를에서 작성한 편지 속에 '별을 그리기 위해 밖으로 나갈 것'이라고 적었다는 것을 생각해보면 그가 이 그림에서 주로 묘사하고자 했던 것이 밤하늘의 풍경, 정확히는 밤하늘 속에서 빛나는 별의 풍경이었다는 것을 알 수 있다.\n" +
        "```\n"
  },
];
